# Το ζητούμενο είναι να εκτελεστεί σε έναν επεξεργαστή MIPS η μεταφορά
# του περιεχομένου του καταχωρητή $s1 πολλαπλασιασμένου επί 8 στον
# καταχωρητή $s3 (δηλαδή $s3 = 8 x $s1). Μπορεί να χρησιμοποιηθεί οποιαδήποτε
# εντολή MIPS από τα σχετικά αρχεία που έχετε στο eclass (όχι ψευδοεντολές)
# και οποιοσδήποτε άλλος καταχωρητής.

# Ουσιώδη Solutions
addi $t0, $0, 3
sllv $s3, $s1, $t0

addiu $t0, $0, 3
sllv $s3, $s1, $t0

ori $t0, $0, 3
sllv $s3, $s1, $t0

xori $t0, $0, 3
sllv $s3, $s1, $t0

addi $t0, $0, 8
mul $s3, $s1, $t0

addiu $t0, $0, 8
mul $s3, $s1, $t0

ori $t0, $0, 8
mul $s3, $s1, $t0

xori $t0, $0, 8
mul $s3, $s1, $t0

add $s3, $s1, $s1
sll $s3, $s1, 2

addu $s3, $s1, $s1
sll $s3, $s1, 2

sll $s3, $s1, 1
sll $s3, $s3, 2

sll $s3, $s1, 3

# "Χακια", μπορεις απλα να αλλάξεις την
# σταθερα και να παρεις πολλους συνδυασμους
addi $t0, $0, 1
sll $s3, $s1, 3